app/controllers/movies_controller.rb

  def index
    @classes = {}
    @all_ratings = Movie.ratings

    if !params.has_key? "ratings"
      if session.has_key?"ratings"
        params["ratings"] = session["ratings"]
        flash.keep
        redirect_to movies_path( params )
      else
        params["ratings"] = Hash[@all_ratings.map{|i| [i,true]}]
      end
    else
      session["ratings"] = params["ratings"]
    end

    @order = session[:order]

    if params.has_key? :order
      @item =  params[:order] + "_header"
      @classes[@item.to_sym]="hilite"
      @order = params[:order] + " asc"
      session[:order]=@order
    end

    @movies = Movie.find(:all , :conditions => {:rating=>params[:ratings].keys} , :order => @order)
---
SELECT "movies".* FROM "movies" WHERE "movies"."rating" IN ('G', 'R', 'PG-13', 'PG') ORDER BY release_date asc
SELECT "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", "PG"]]